Homework 4/characters/app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters"
---
  def index
    @chars = Character.all

INSERT INTO "characters" ("name", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Fragwith"], ["role", "Tank"], ["created_at", "2017-10-31 22:39:48.034308"], ["updated_at", "2017-10-31 22:39:48.034308"]]
---
  def create
    @char = Character.new(req_params)
    if @char.save

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_params
    @char = Character.find(params[:id])