Homework 4/market/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "qty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Milk"], ["price", 15.25], ["qty", 20], ["created_at", "2017-10-31 20:59:43.986526"], ["updated_at", "2017-10-31 20:59:43.986526"]]
---
  def create
    @product = Product.new(req_params)
    if @product.save

UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Chocolate Millk"], ["updated_at", "2017-10-31 21:00:05.648185"], ["id", 1]]
---
  def update
    find_params
    if @product.update(req_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    find_params
    @product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_params
    @product = Product.find(params[:id])