Homework 4/toys/app/controllers/toys_controller.rb

SELECT "toys".* FROM "toys"
---
  def index
    @toys = Toy.all

INSERT INTO "toys" ("name", "qty", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bibika"], ["qty", 123], ["created_at", "2017-10-31 19:08:26.451726"], ["updated_at", "2017-10-31 19:08:26.451726"]]
---
  def create
    @toy = Toy.new(req_params)
    if @toy.save

UPDATE "toys" SET "qty" = ?, "updated_at" = ? WHERE "toys"."id" = ?  [["qty", 665], ["updated_at", "2017-10-31 19:10:15.317221"], ["id", 2]]
---
  def update
    find_params
    if @toy.update(req_params)

DELETE FROM "toys" WHERE "toys"."id" = ?  [["id", 1]]
---
  def destroy
    find_params
    @toy.destroy

SELECT  "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_params
    @toy = Toy.find(params[:id])