Homework 4/articles/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Pipko"], ["body", "ASdvnodfa;\r\nasdfijvma, fiajfs\r\nfarifoisfnLKd"], ["created_at", "2017-10-31 15:18:18.180854"], ["updated_at", "2017-10-31 15:18:18.180854"]]
---
  def create
    @article = Article.new(req_params)
    if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Faggity Fag 123"], ["updated_at", "2017-10-31 15:35:19.988350"], ["id", 5]]
---
  def update
    find_params
    if @article.update(req_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    find_params
    @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_params
    @article = Article.find(params[:id])