Homework 4/cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(params_req)

    if @cat.save
---
INSERT INTO "cats" ("name", "breed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Blacky"], ["breed", "Fabulous"], ["created_at", "2017-10-30 19:18:38.380050"], ["updated_at", "2017-10-30 19:18:38.380050"]]

  def update
    find_params

    if @cat.update(params_req)
---
UPDATE "cats" SET "breed" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["breed", "Fabulousfdsf"], ["updated_at", "2017-10-30 19:24:44.026551"], ["id", 1]]

  def destroy
    find_params
    @cat.destroy
---
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 1]]

  def find_params
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]