Homework 4/songs/app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def create
    @song = Song.new(req_params)
    if @song.save
---
INSERT INTO "songs" ("artist", "title", "album", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "Linkin Park"], ["title", "In The End"], ["album", "Meteora"], ["created_at", "2017-10-31 21:42:10.799206"], ["updated_at", "2017-10-31 21:42:10.799206"]]

  def update
    find_params
    if @song.update(req_params)
---
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "In The End1"], ["updated_at", "2017-10-31 21:42:31.278608"], ["id", 1]]

  def destroy
    find_params
    @song.destroy
---
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]

  def find_params
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]