Homework 4/dogs/app/controllers/dogs_controller.rb

  def create
    @dog = Dog.new(dog_params_req)

    if @dog.save
---
INSERT INTO "dogs" ("name", "breed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pipko"], ["breed", "Stray"], ["created_at", "2017-10-30 18:01:08.250051"], ["updated_at", "2017-10-30 18:01:08.250051"]]

  def update
    dog_params_find

    if @dog.update(dog_params_req)
---
UPDATE "dogs" SET "breed" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["breed", "Border-collie"], ["updated_at", "2017-10-30 18:04:59.712365"], ["id", 2]]

  def destroy
    dog_params_find
    @dog.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 1]]