Homework 4/users/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params_req)

    if @user.save
---
INSERT INTO "users" ("name", "age", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Vasia"], ["age", 22], ["email", "vv@vv.sd"], ["created_at", "2017-10-28 12:16:03.863126"], ["updated_at", "2017-10-28 12:16:03.863126"]]

  def update
    user_params_find

    if @user.update(user_params_req)
---
UPDATE "users" SET "age" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 23], ["email", "vv@vv.sda"], ["updated_at", "2017-10-28 13:22:51.528149"], ["id", 1]]

  def destroy
    user_params_find
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]