Homework 4/countries/app/controllers/countries_controller.rb

INSERT INTO "countries" ("name", "area", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Zimbabmwe"], ["area", 32], ["created_at", "2017-10-31 19:59:50.808053"], ["updated_at", "2017-10-31 19:59:50.808053"]]
---
  def create
    @country = Country.new(req_params)
    if @country.save

UPDATE "countries" SET "name" = ?, "area" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["name", "America"], ["area", 213], ["updated_at", "2017-10-31 19:49:30.476236"], ["id", 1]]
---
  def update
    find_params
    if @country.update(req_params)

DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 1]]
---
  def destroy
    find_params
    @country.destroy

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_params
    @country = Country.find(params[:id])