Homework 4/cars/app/controllers/cars_controller.rb

INSERT INTO "cars" ("manufacturer", "model", "yop", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["manufacturer", "Toyota"], ["model", "Klizma"], ["yop", 2017], ["created_at", "2017-10-31 16:56:16.078574"], ["updated_at", "2017-10-31 16:56:16.078574"]]
---
  def create
    @car = Car.new(req_params)

    if @car.save

UPDATE "cars" SET "manufacturer" = ?, "model" = ?, "yop" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["manufacturer", "Atatr3"], ["model", "1231s"], ["yop", 2773], ["updated_at", "2017-10-31 17:36:30.625608"], ["id", 1]]
---
  def update
    find_params

    if @car.update(req_params)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
---
  def destroy
    find_params
    @car.destroy

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_params
    @car = Car.find(params[:id])