Homework 4/paintings/app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
  def index
    @paintings = Painting.all

INSERT INTO "paintings" ("title", "artist", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Black square"], ["artist", "Malevish"], ["year", 1888], ["created_at", "2017-10-31 22:14:16.306634"], ["updated_at", "2017-10-31 22:14:16.306634"]]
---
  def create
    @painting = Painting.new(req_params)
    if @painting.save

UPDATE "paintings" SET "title" = ?, "updated_at" = ? WHERE "paintings"."id" = ?  [["title", "Black square213"], ["updated_at", "2017-10-31 22:15:04.453140"], ["id", 1]]
---
  def update
    find_params
    if @painting.update(req_params)

DELETE FROM "paintings" WHERE "paintings"."id" = ?  [["id", 1]]
---
  def destroy
    find_params
    @painting.destroy

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_params
    @painting = Painting.find(params[:id])